{"status":"ok","totalResults":4601,"articles":[{"source":{"id":"mashable","name":"Mashable"},"author":"Jack Morse","title":"J.K. Rowling is four cocktails in and talking trash about Bitcoin","description":"J.K. Rowling has been drinking a lot and you'd better believe she has some thoughts on Bitcoin.\nNoted TERF and author of The Cuckoo’s Calling, Rowling decided Friday was the perfect time to learn about the cryptocurrency Bitcoin. And so, like any celebrity wh…","url":"https://mashable.com/article/jk-rowling-asked-twitter-about-bitcoin/","urlToImage":"https://mondrian.mashable.com/2020%252F05%252F16%252Fed%252F65127486efd14faea068927124f3b1ee.253ab.jpg%252F1200x630.jpg?signature=XjJ4aqKaX56MW5k29Zn1ygz0Evc=","publishedAt":"2020-05-16T00:34:00Z","content":"J.K. Rowling has been drinking a lot and you'd better believe she has some thoughts on Bitcoin.\r\nNotedTERF and author of The Cuckoos Calling, Rowlingdecided Friday was the perfect time to learn about… [+2124 chars]"},{"source":{"id":null,"name":"Gizmodo.com"},"author":"Tom McKay","title":"God Help Us, the Winklevoss Twins Are Co-Producing a Movie About Their Bitcoin Journey","description":"The Winklevoss twins—the brothers Mark Zuckerberg allegedly stole the idea for Facebook from—are making a movie about themselves, Deadline reported this week. If that doesn’t seem masturbatory enough, rejoice: said film is about how they amassed a net wealth …","url":"https://gizmodo.com/god-help-us-the-winklevoss-twins-are-co-producing-a-mo-1843973511","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/iujekjzgrttsevxxzbop.jpg","publishedAt":"2020-06-09T23:45:00Z","content":"The Winklevoss twinsthe brothers Mark Zuckerberg allegedly stole the idea for Facebook fromare making a movie about themselves, Deadline reported this week. If that doesnt seem masturbatory enough, r… [+2657 chars]"},{"source":{"id":"techcrunch","name":"TechCrunch"},"author":"Alex Wilhelm","title":"FalconX raises $17M to power its crypto trading service","description":"Over the last few weeks all eyes in the crypto world have been glued to the halvening, a nigh-religious moment in the blockchain realm. Every once in a while, the amount of new bitcoin mined — distributed to miners, the folks with fleets of computers powering…","url":"http://techcrunch.com/2020/05/13/falconx-raises-17m-to-power-its-crypto-trading-service/","urlToImage":"https://techcrunch.com/wp-content/uploads/2019/04/bitcoin-bitfinex.jpg?w=750","publishedAt":"2020-05-13T15:46:38Z","content":"Over the last few weeks all eyes in the crypto world have been glued to the halvening, a nigh-religious moment in the blockchain realm. Every once in a while, the amount of new bitcoin mined — distri… [+4849 chars]"}]}